cases/cubicBuilding/cubicBuilding.simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

	#include "include/ABLConditions"
	
    top
    {
        type            slip;
    }

    inlet
    {
		type 			atmBoundaryLayerInletVelocity;
		Uref 			$Uref;
		Zref 			$Href;
		flowDir 				$windDirection;
		zDir 				$zDirection;
		z0 				$z0;
		value 			$internalField;
		zGround 		$zGround;	
    }

    outlet 
    {
		type			zeroGradient;
    }
    ground      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cube      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sides
    {
		type			slip;
    }
}

// ************************************************************************* //
