cases/cubicBuilding/cubicBuilding.simpleFoam/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Href                 10;
z0                   uniform 0.03;
windDirection        (1 0 0);
zDirection           (0 1 0);
zGround              uniform 0.0;
// ************************************************************************* //
