cases/cubicBuilding/cubicBuilding.simpleFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            slip;
    }
    inlet
    {
		type			zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value      		$internalField;
    }

    ground      
    {
        type            zeroGradient;
    }
    cube      
    {
        type            zeroGradient;
    }
    sides
    {
		type			slip;
    }
}

// ************************************************************************* //
