cases/cubicBuilding/cubicBuilding.simpleFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (0 0 0)
  (50 0 0)
  (55 0 0)
  (60 0 0)
  (210 0 0)
  (0 5 0)
  (50 5 0)
  (55 5 0)
  (60 5 0)
  (210 5 0)
  (0 10 0)
  (50 10 0)
  (55 10 0)
  (60 10 0)
  (210 10 0)
  (0 60 0)
  (50 60 0)
  (55 60 0)
  (60 60 0)
  (210 60 0)
  (0 0 50)
  (50 0 50)
  (55 0 50)
  (60 0 50)
  (210 0 50)
  (0 5 50)
  (50 5 50)
  (55 5 50)
  (60 5 50)
  (210 5 50)
  (0 10 50)
  (50 10 50)
  (55 10 50)
  (60 10 50)
  (210 10 50)
  (0 60 50)
  (50 60 50)
  (55 60 50)
  (60 60 50)
  (210 60 50)
  (0 0 55)
  (50 0 55)
  (55 0 55)
  (60 0 55)
  (210 0 55)
  (0 5 55)
  (50 5 55)
  (55 5 55)
  (60 5 55)
  (210 5 55)
  (0 10 55)
  (50 10 55)
  (55 10 55)
  (60 10 55)
  (210 10 55)
  (0 60 55)
  (50 60 55)
  (55 60 55)
  (60 60 55)
  (210 60 55)
  (0 0 60)
  (50 0 60)
  (55 0 60)
  (60 0 60)
  (210 0 60)
  (0 5 60)
  (50 5 60)
  (55 5 60)
  (60 5 60)
  (210 5 60)
  (0 10 60)
  (50 10 60)
  (55 10 60)
  (60 10 60)
  (210 10 60)
  (0 60 60)
  (50 60 60)
  (55 60 60)
  (60 60 60)
  (210 60 60)
  (0 0 110)
  (50 0 110)
  (55 0 110)
  (60 0 110)
  (210 0 110)
  (0 5 110)
  (50 5 110)
  (55 5 110)
  (60 5 110)
  (210 5 110)
  (0 10 110)
  (50 10 110)
  (55 10 110)
  (60 10 110)
  (210 10 110)
  (0 60 110)
  (50 60 110)
  (55 60 110)
  (60 60 110)
  (210 60 110)
);
 
blocks
(
  hex (0 1 6 5 20 21 26 25) (30 15 30) simpleGrading (0.014550068805071 7.6137909574172 0.014550068805071)
  hex (1 2 7 6 21 22 27 26) (15 15 30) simpleGrading (7.6137909574172 7.6137909574172 0.014550068805071)
  hex (2 3 8 7 22 23 28 27) (15 15 30) simpleGrading (0.131340616737134 7.6137909574172 0.014550068805071)
  hex (3 4 9 8 23 24 29 28) (40 15 30) simpleGrading (189.630666663524 7.6137909574172 0.014550068805071)
  hex (5 6 11 10 25 26 31 30) (30 15 30) simpleGrading (0.014550068805071 0.131340616737134 0.014550068805071)
  hex (6 7 12 11 26 27 32 31) (15 15 30) simpleGrading (7.6137909574172 0.131340616737134 0.014550068805071)
  hex (7 8 13 12 27 28 33 32) (15 15 30) simpleGrading (0.131340616737134 0.131340616737134 0.014550068805071)
  hex (8 9 14 13 28 29 34 33) (40 15 30) simpleGrading (189.630666663524 0.131340616737134 0.014550068805071)
  hex (10 11 16 15 30 31 36 35) (30 30 30) simpleGrading (0.014550068805071 68.7281973287726 0.014550068805071)
  hex (11 12 17 16 31 32 37 36) (15 30 30) simpleGrading (7.6137909574172 68.7281973287726 0.014550068805071)
  hex (12 13 18 17 32 33 38 37) (15 30 30) simpleGrading (0.131340616737134 68.7281973287726 0.014550068805071)
  hex (13 14 19 18 33 34 39 38) (40 30 30) simpleGrading (189.630666663524 68.7281973287726 0.014550068805071)
  hex (20 21 26 25 40 41 46 45) (30 15 15) simpleGrading (0.014550068805071 7.6137909574172 7.6137909574172)
  hex (23 24 29 28 43 44 49 48) (40 15 15) simpleGrading (189.630666663524 7.6137909574172 7.6137909574172)
  hex (25 26 31 30 45 46 51 50) (30 15 15) simpleGrading (0.014550068805071 0.131340616737134 7.6137909574172)
  hex (28 29 34 33 48 49 54 53) (40 15 15) simpleGrading (189.630666663524 0.131340616737134 7.6137909574172)
  hex (30 31 36 35 50 51 56 55) (30 30 15) simpleGrading (0.014550068805071 68.7281973287726 7.6137909574172)
  hex (31 32 37 36 51 52 57 56) (15 30 15) simpleGrading (7.6137909574172 68.7281973287726 7.6137909574172)
  hex (32 33 38 37 52 53 58 57) (15 30 15) simpleGrading (0.131340616737134 68.7281973287726 7.6137909574172)
  hex (33 34 39 38 53 54 59 58) (40 30 15) simpleGrading (189.630666663524 68.7281973287726 7.6137909574172)
  hex (40 41 46 45 60 61 66 65) (30 15 15) simpleGrading (0.014550068805071 7.6137909574172 0.131340616737134)
  hex (43 44 49 48 63 64 69 68) (40 15 15) simpleGrading (189.630666663524 7.6137909574172 0.131340616737134)
  hex (45 46 51 50 65 66 71 70) (30 15 15) simpleGrading (0.014550068805071 0.131340616737134 0.131340616737134)
  hex (48 49 54 53 68 69 74 73) (40 15 15) simpleGrading (189.630666663524 0.131340616737134 0.131340616737134)
  hex (50 51 56 55 70 71 76 75) (30 30 15) simpleGrading (0.014550068805071 68.7281973287726 0.131340616737134)
  hex (51 52 57 56 71 72 77 76) (15 30 15) simpleGrading (7.6137909574172 68.7281973287726 0.131340616737134)
  hex (52 53 58 57 72 73 78 77) (15 30 15) simpleGrading (0.131340616737134 68.7281973287726 0.131340616737134)
  hex (53 54 59 58 73 74 79 78) (40 30 15) simpleGrading (189.630666663524 68.7281973287726 0.131340616737134)
  hex (60 61 66 65 80 81 86 85) (30 15 30) simpleGrading (0.014550068805071 7.6137909574172 68.7281973287726)
  hex (61 62 67 66 81 82 87 86) (15 15 30) simpleGrading (7.6137909574172 7.6137909574172 68.7281973287726)
  hex (62 63 68 67 82 83 88 87) (15 15 30) simpleGrading (0.131340616737134 7.6137909574172 68.7281973287726)
  hex (63 64 69 68 83 84 89 88) (40 15 30) simpleGrading (189.630666663524 7.6137909574172 68.7281973287726)
  hex (65 66 71 70 85 86 91 90) (30 15 30) simpleGrading (0.014550068805071 0.131340616737134 68.7281973287726)
  hex (66 67 72 71 86 87 92 91) (15 15 30) simpleGrading (7.6137909574172 0.131340616737134 68.7281973287726)
  hex (67 68 73 72 87 88 93 92) (15 15 30) simpleGrading (0.131340616737134 0.131340616737134 68.7281973287726)
  hex (68 69 74 73 88 89 94 93) (40 15 30) simpleGrading (189.630666663524 0.131340616737134 68.7281973287726)
  hex (70 71 76 75 90 91 96 95) (30 30 30) simpleGrading (0.014550068805071 68.7281973287726 68.7281973287726)
  hex (71 72 77 76 91 92 97 96) (15 30 30) simpleGrading (7.6137909574172 68.7281973287726 68.7281973287726)
  hex (72 73 78 77 92 93 98 97) (15 30 30) simpleGrading (0.131340616737134 68.7281973287726 68.7281973287726)
  hex (73 74 79 78 93 94 99 98) (40 30 30) simpleGrading (189.630666663524 68.7281973287726 68.7281973287726)
);
 
edges
(
);
 
patches
(
  patch inlet
  (
      (0 20 25 5)
      (5 25 30 10)
      (10 30 35 15)
      (20 40 45 25)
      (25 45 50 30)
      (30 50 55 35)
      (40 60 65 45)
      (45 65 70 50)
      (50 70 75 55)
      (60 80 85 65)
      (65 85 90 70)
      (70 90 95 75)
  )
  patch outlet
  (
      (4 24 29 9)
      (9 29 34 14)
      (14 34 39 19)
      (24 44 49 29)
      (29 49 54 34)
      (34 54 59 39)
      (44 64 69 49)
      (49 69 74 54)
      (54 74 79 59)
      (64 84 89 69)
      (69 89 94 74)
      (74 94 99 79)
  )
  slip top
  (
      (15 16 36 35)
      (16 17 37 36)
      (17 18 38 37)
      (18 19 39 38)
      (35 36 56 55)
      (36 37 57 56)
      (37 38 58 57)
      (38 39 59 58)
      (55 56 76 75)
      (56 57 77 76)
      (57 58 78 77)
      (58 59 79 78)
      (75 76 96 95)
      (76 77 97 96)
      (77 78 98 97)
      (78 79 99 98)
  )
  wall ground
  (
      (0 1 21 20)
      (1 2 22 21)
      (2 3 23 22)
      (3 4 24 23)
      (20 21 41 40)
      (23 24 44 43)
      (40 41 61 60)
      (43 44 64 63)
      (60 61 81 80)
      (61 62 82 81)
      (62 63 83 82)
      (63 64 84 83)
  )
  slip sides
  (
      (0 1 6 5)
      (1 2 7 6)
      (2 3 8 7)
      (3 4 9 8)
      (5 6 11 10)
      (6 7 12 11)
      (7 8 13 12)
      (8 9 14 13)
      (10 11 16 15)
      (11 12 17 16)
      (12 13 18 17)
      (13 14 19 18)
      (80 81 86 85)
      (81 82 87 86)
      (82 83 88 87)
      (83 84 89 88)
      (85 86 91 90)
      (86 87 92 91)
      (87 88 93 92)
      (88 89 94 93)
      (90 91 96 95)
      (91 92 97 96)
      (92 93 98 97)
      (93 94 99 98)
  )
  wall cube
  (
      (21 22 27 26)	
	  (22 23 28 27)
	  (26 27 32 31)
	  (27 28 33 32)
      (61 62 67 66)	
	  (62 63 68 67)
	  (66 67 72 71)
	  (67 68 73 72)	  
	  (21 41 46 26)
	  (41 61 66 46)
	  (26 46 51 31)
	  (46 66 71 51)
	  (23 43 48 28)
	  (43 63 68 48)
	  (28 48 53 33)
	  (48 68 73 53)
	  (31 32 52 51)
	  (32 33 53 52)
	  (51 52 72 71)
	  (52 53 73 72)
  )   
);
 
mergePatchPairs
(
);

// ************************************************************************* //
